========================================================================================
Network Service Discovery - Suspicious Network Scanning via nmap.exe from Standalone Exe
========================================================================================
// Description:  
// Detects the execution of nmap.exe from non-system directories to perform network scanning. This may indicate unauthorized reconnaissance or malicious activity using a standalone executable.
//
// Action on alert:  
// Investigate the process context, analyze command-line arguments for intent, and Identify the user account. Check for authority of User and confirm if the TargetIP scanned belongs to critical assets or sensitive infrastructure. Isolate the affected device if malicious activity is suspected.
//
// Creator:  
// Shikha Sangwan  
//
DeviceProcessEvents
| where TimeGenerated > ago(40m)
| where FileName contains "\nmap.exe"
| where not(FolderPath startswith @"C:\Windows") // Exclude common system directory
| where not(FolderPath startswith @"C:\Program Files") // Exclude another common directory
| where not(FolderPath startswith @"C:\Program Files (x86)") // Exclude 32-bit program folder
| extend TargetIP = extract(@"(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})", 1, ProcessCommandLine)
| where FolderPath !contains "Tanium"
| project TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, TargetIP, InitiatingProcessAccountName
| limit 100


