========================================================================================
Network Service Discovery - Suspicious Network Scanning via nmap.exe from Standalone Exe
========================================================================================
// Description:  
// Detects the execution of nmap.exe from non-system directories to perform network scanning. This may indicate unauthorized reconnaissance or malicious activity using a standalone executable.
//
// Action on alert:  
// Investigate the process context, analyze command-line arguments for intent, and Identify the user account. Check for authority of User and confirm if the TargetIP scanned belongs to critical assets or sensitive infrastructure. Isolate the affected device if malicious activity is suspected.
//
// Creator:  
// Shikha Sangwan  
//
DeviceProcessEvents
| where TimeGenerated > ago(40m)
| where FileName contains "\nmap.exe"
| where not(FolderPath startswith @"C:\Windows") // Exclude common system directory
| where not(FolderPath startswith @"C:\Program Files") // Exclude another common directory
| where not(FolderPath startswith @"C:\Program Files (x86)") // Exclude 32-bit program folder
| extend TargetIP = extract(@"(\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})", 1, ProcessCommandLine)
| where FolderPath !contains "Tanium"
| project TimeGenerated, DeviceName, FileName, FolderPath, ProcessCommandLine, TargetIP, InitiatingProcessAccountName
| limit 100

=================================================================================
System Time Discovery - Suspicious Local Time Lookup Using Net for Reconnaissance
=================================================================================
// Description:
// Checking for file that will perform local time lookups using net utility. Threat actors gather time as part of their reconnaissance activity. This query specifically looks for "net time" command executed from a file not from the cmd.exe. 
//
// Action on alert:
// Check what the file is, what it was installed by, and whether it is signed. Check any further actions done by the file. 
// 
// Source:
// https://www.cybereason.com/blog/operation-cuckoobees-deep-dive-into-stealthy-winnti-techniques
// https://web.archive.org/web/20170718174931/https://www.melani.admin.ch/dam/melani/de/dokumente/2016/technical%20report%20ruag.pdf.download.pdf/Report_Ruag-Espionage-Case.pdf
//
// Creator:
// Shikha Sangwan
//
// QUERY:
DeviceProcessEvents
| where ProcessCommandLine contains " time " and ProcessCommandLine startswith "net "
| where not(InitiatingProcessCommandLine matches regex @"^""cmd\.exe""\s*$")
| where ProcessCommandLine !contains "/set"
| project TimeGenerated, AccountName, DeviceName, ProcessCommandLine, FileName, InitiatingProcessCommandLine, InitiatingProcessFileName
| limit 100
