Domain Account Creation via net.exe
====================================   
// Description:  
// Detects the creation of new domain user accounts by monitoring for the execution of net.exe user <username> <password> /add /domain on Windows systems. Attackers with sufficient privileges may use this technique to establish persistence or escalate privileges within an Active Directory environment.
//
// Action on alert:  
// Verify whether the initiating user and device are authorized to perform domain account creation. Check if the created account and associated credentials are expected. If unauthorized or suspicious, disable the newly created account and investigate the source system for further compromise. It is likely this request failed and the account was not created, but the fact the command was run may indicate an attacker on the machine. You can check if the account was successfully created using an on-prem directory explorer such as ADExplorer.
//
// Source:  
// https://attack.mitre.org/techniques/T1136/002/
// https://www.microsoft.com/en-us/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
// https://medium.com/@RootRouteway/hacking-active-directory-from-reconnaissance-to-exploitation-part-2-f2630b836e73
//
// Creator:  
// Shikha Sangwan  
DeviceProcessEvents
| where FileName contains "net.exe"
| where ProcessCommandLine matches regex @"^net\s+user.*\/add.*\/domain"
| project TimeGenerated, DeviceName, InitiatingProcessAccountName, ProcessCommandLine, FolderPath, FileName

